# The Pandas DataFrame

The Pandas [DataFrame](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html) is a data structure that is houses two-dimensional, size-mutable, potentially heterogeneous tabular data.  We will take a look some of the capabilities of the Pandas DataFrame in this notebook.

In [3]:
# Common Imports
import pandas as pd
import numpy as np

## Creating a DataFrame

There are numerous ways to create a DataFrame; a few are shown below:

In [5]:
# From a Dictionary
dictionary = {'col1':[1,2], 'col2': [3,4]}
df1 = pd.DataFrame(data=dictionary)
df1

   col1  col2
0     1     3
1     2     4

In [6]:
# From a Numpy Array:
my_arr = np.array([[1,2,3], [4,5,6], [7,8,9]])
df2 = pd.DataFrame(my_arr, columns=['a', 'b', 'c'])
df2

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

## Importing Data

To import data from a csv file, use the [read_csv()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html) function.  To import data from an Excel file, use the [Excel()](https://www.kite.com/python/docs/pandas.ExcelFile) class and [read_excel()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_excel.html) function.

In [9]:
# Importing from csv File
fileName = "ExampleData_1.csv"
df3=pd.read_csv(fileName, header=0)
df3

    3   6   9
0  12  15  18
1  21  24  27

In [13]:
# Importing from Excel File
fileName = "ExampleData_2.xlsx"
xls = pd.ExcelFile(fileName)
df4 = pd.read_excel(xls, 'Sheet1')
df5 = pd.read_excel(xls, 'Sheet2')
df4

   Greeting  Num_1  Num_2
0    Hello       5  23.57
1    Hello       7  68.18
2  Good Bye      9  90.32
3  Good Bye      2  17.63

# Dropping Data

Use the [drop()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop.html) method to remove rows or columns by specifying label names and the corresponding axis, or by specifying directly index or column names.

#### Dropping Columns

In [14]:
# View DataFrame First
df5

    Fruit  Num_1  Num_2
0   Apple     13    5.6
1  Orange     15    7.8
2   Grape     17    9.1

In [15]:
# View DataFrame after Drop Method Invoked
df5.drop(['Fruit', 'Num_2'], axis=1)

   Num_1
0     13
1     15
2     17

In [16]:
# View DataFrame Again
df5

    Fruit  Num_1  Num_2
0   Apple     13    5.6
1  Orange     15    7.8
2   Grape     17    9.1

In [17]:
# To Change the State of the Host Object:
df5 = df5.drop(['Fruit', 'Num_2'], axis=1)

In [18]:
# View DataFrame Again
df5

   Num_1
0     13
1     15
2     17

#### Dropping Rows

In [ ]:
# View DataFrame First
df4

In [23]:
#axis is row =0, axis = 1 is col
df4 = df4.drop([0,2], axis=0)

In [24]:
# View DataFrame Again
df4

   Greeting  Num_1  Num_2
1    Hello       7  68.18
3  Good Bye      2  17.63

## DataFrame Indexing

To access the columns of a DataFrame, simply index the DataFrame using the column label:

In [31]:
#df4[['Greeting']] # returns a data frame by indexing a list
#df4['Greeting']
df4[['Greeting', 'Num_2']] # needs double brackets

   Greeting  Num_2
1    Hello   68.18
3  Good Bye  17.63

Use the [loc[]](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.loc.html) method to access groups of elements by label.  Use the [iloc[]](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.iloc.html) method for integer-based positional indexing.

In [32]:
mydict = [{'a':1, 'b':2, 'c':3, 'd':4}, 
         {'a':10, 'b':20, 'c':30, 'd':40}, 
         {'a':100, 'b':200, 'c':300, 'd':400}, 
         {'a':1000, 'b':2000, 'c':3000, 'd':4000}]
df6 = pd.DataFrame(mydict)
df6

      a     b     c     d
0     1     2     3     4
1    10    20    30    40
2   100   200   300   400
3  1000  2000  3000  4000

In [36]:
# What will the following lines return?
#df6.iloc[[1]]
#df6.iloc[[1,3]]
df6.iloc[1,3]

40

In [39]:
# Create DataFrame
my_arr = np.array([[1,2,1], [3,4,10], [5,6,100], [7,8,1000]])
df7 = pd.DataFrame(my_arr, index = ['Harry', 'Hermione', 'Ronald', 'Dumbledore'], 
                  columns=['High', 'Medium', 'Low'])
df7

            High  Medium   Low
Harry          1       2     1
Hermione       3       4    10
Ronald         5       6   100
Dumbledore     7       8  1000

In [45]:
# What will be returned from these lines?
#df7.loc['Harry']
#df7.loc['Harry', 'High']
#df7.loc['Harry', 'High':'Medium']
# You can also pass a Boolean array!
#df7.loc[df7['Medium'] <5]
df7['Medium'] <5

Harry          True
Hermione       True
Ronald        False
Dumbledore    False
Name: Medium, dtype: bool

## Appending Rows to a DataFrame

Use the [append()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.append.html) method to append rows to the end of the host object, which _returns a new object_.  Also, the append method can be used on lists.

In [50]:
df1 = pd.DataFrame([[1,2], [3,4]], columns = list('AB'))
df1

   A  B
0  1  2
1  3  4

In [49]:
df2 = pd.DataFrame([[5,6], [7,8]], columns = list('AB'))
df2

   A  B
0  5  6
1  7  8

In [ ]:
df1.append(df2)

Note that columns in the object to be added that are not already in the host object are added as new columns.

In [55]:
df3 = pd.DataFrame([[5,6], [7,8]], columns = list('ab'))
df3
df1.append(df3)

     A    B    a    b
0  1.0  2.0  NaN  NaN
1  3.0  4.0  NaN  NaN
0  NaN  NaN  5.0  6.0
1  NaN  NaN  7.0  8.0

Python lists also have the `append()` method.  For example, write code to make the following list using nested for loops: 

`['A', 'B', 'C', 'A', 'B', 'C', 'A', 'B', 'C']`

In [56]:
my_list = []
for y in range(3): 
    for x in ['A', 'B', 'C']: 
        my_list.append(x)
        
print(my_list)

['A', 'B', 'C', 'A', 'B', 'C', 'A', 'B', 'C']

## Adding Columns to a DataFrame

There are several ways to add a new column to a Pandas DataFrame. Let's start by examining our DataFrame:

In [58]:
df1 = pd.DataFrame([[1,3], [2,4]], columns = list('AB'))
df1

   A  B
0  1  3
1  2  4

The first method is by declaring a new list as a column, which will be added to the end of the DataFrame:

In [59]:
df1['C'] = [5,6]
df1

   A  B  C
0  1  3  5
1  2  4  6

The second method is by invoking the [insert()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.insert.html) method, which inserts a column into a DataFrame at specified location. A ValueError is raised if the inserted column is already contained in the DataFrame, unless the `allow_duplicates` parameter is set to `True`.

In [62]:
df1.insert(1, "A'", [2,3], True) # True is in allow duplicates
df1

   A  A'  A'  A'  B  C
0  1   2   2   2  3  5
1  2   3   3   3  4  6

The third method is by invoking the [assign()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.assign.html) method, which returns a new object with all original columns in addition to new ones. Existing columns that are re-assigned will be overwritten.

In [63]:
df1 = df1.assign(D=[6,7])
df1

   A  A'  A'  A'  B  C  D
0  1   2   2   2  3  5  6
1  2   3   3   3  4  6  7

## Renaming DataFrame Columns

Use the [rename()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rename.html) method.

In [64]:
df1=df1.rename(columns = {"A'":'B', 'B':'C', 'C':'D', 'D':'E'})
df1

   A  B  B  B  C  D  E
0  1  2  2  2  3  5  6
1  2  3  3  3  4  6  7

# Merging DataFrames

The [merge()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.merge.html) method is akin to a SQL join expression.

The join is done on columns or indexes (i.e. "rows"). If joining columns on columns, the DataFrame indexes will be ignored. Otherwise if joining indexes on indexes or indexes on a column or columns, the index will be passed on.

In [65]:
my_arr = np.array([['Susan', 'Vanilla', 'Skittles'], 
                   ['Nick', 'Chocolate', 'M&Ms'],
                  ['Carol', 'Chocolate Chip', 'Milky Way']])

my_col = ['person', 'iceCream', 'candy']

favSweets = pd.DataFrame(my_arr, columns=my_col)
favSweets

  person        iceCream      candy
0  Susan         Vanilla   Skittles
1   Nick       Chocolate       M&Ms
2  Carol  Chocolate Chip  Milky Way

In [66]:
my_arr = np.array([['Nick', 'Orange Juice', 'Coca-Cola'], 
                   ['Carol', 'Apple Juice', 'Sprite'],
                  ['Peter', 'Grape Juice', 'Mountain Dew']])

my_col = ['person', 'juice', 'soda']

favDrinks = pd.DataFrame(my_arr, columns=my_col)
favDrinks

  person         juice          soda
0   Nick  Orange Juice     Coca-Cola
1  Carol   Apple Juice        Sprite
2  Peter   Grape Juice  Mountain Dew

We can merge these two DataFrames on the `person` attribute with the following code - we will perform an inner join:

In [68]:
joined_df = favSweets.merge(favDrinks, how='inner', on='person')
joined_df

  person        iceCream      candy         juice       soda
0   Nick       Chocolate       M&Ms  Orange Juice  Coca-Cola
1  Carol  Chocolate Chip  Milky Way   Apple Juice     Sprite

What if the column to be joined on in the two DataFrames have different names?

In [78]:
favDrinks = favDrinks.rename(columns={'person': 'human'})
favDrinks

   human         juice          soda
0   Nick  Orange Juice     Coca-Cola
1  Carol   Apple Juice        Sprite
2  Peter   Grape Juice  Mountain Dew

In [79]:
joined_df = favSweets.merge(favDrinks, how='inner', left_on='person', right_on = 'human')
joined_df

  person        iceCream      candy  human         juice       soda
0   Nick       Chocolate       M&Ms   Nick  Orange Juice  Coca-Cola
1  Carol  Chocolate Chip  Milky Way  Carol   Apple Juice     Sprite

In [80]:
joined_df = joined_df.drop(['human'], axis=1)
joined_df

  person        iceCream      candy         juice       soda
0   Nick       Chocolate       M&Ms  Orange Juice  Coca-Cola
1  Carol  Chocolate Chip  Milky Way   Apple Juice     Sprite

# Convert a DataFrame to a NumPy Array

Use the [to_numpy()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_numpy.html) method.

In [81]:
print(joined_df.to_numpy())

[['Nick' 'Chocolate' 'M&Ms' 'Orange Juice' 'Coca-Cola']
 ['Carol' 'Chocolate Chip' 'Milky Way' 'Apple Juice' 'Sprite']]